---
kind: method
id: M:Autodesk.Revit.DB.ForgeTypeId.#ctor(System.String)
source: html/4777ba3d-8f1e-399c-8f3a-cca084b2d42b.htm
---
# Autodesk.Revit.DB.ForgeTypeId.#ctor Method

Constructs a ForgeTypeId holding the given schema identifier.

## Syntax (C#)
```csharp
public ForgeTypeId(
	string typeId
)
```

## Parameters
- **typeId** (`System.String`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null